libmcu/madi/ports/stm32/f1/uart1.c
#include "stm32f1xx_hal.h"

static UART_HandleTypeDef huart1;

static void initialize_gpio(void)
{
	__HAL_RCC_GPIOA_CLK_ENABLE();

	GPIO_InitTypeDef GPIO_InitStruct = {
		.Pin = GPIO_PIN_9,
		.Mode = GPIO_MODE_AF_PP,
		.Speed = GPIO_SPEED_FREQ_HIGH,
	};
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	GPIO_InitStruct.Pin = GPIO_PIN_10;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

static int initialize_uart1(uint32_t baudrate)
{
	initialize_gpio();

	__HAL_RCC_USART1_CLK_ENABLE();

	huart1.Instance = USART1;
	huart1.Init.BaudRate = baudrate;
	huart1.Init.WordLength = UART_WORDLENGTH_8B;
	huart1.Init.StopBits = UART_STOPBITS_1;
	huart1.Init.Parity = UART_PARITY_NONE;
	huart1.Init.Mode = UART_MODE_TX_RX;
	huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart1.Init.OverSampling = UART_OVERSAMPLING_16;

	return HAL_UART_Init(&huart1);
}

static void deinitialize_gpio(void)
{
	HAL_GPIO_DeInit(GPIOA, GPIO_PIN_9 | GPIO_PIN_10);
}

static void deinitialize_uart1(void)
{
	deinitialize_gpio();
	__HAL_RCC_USART1_CLK_DISABLE();
}

static size_t uart1_write(void const *data, size_t datasize)
{
	return HAL_UART_Transmit(&huart1, data, (uint16_t)datasize, 100U)
			== HAL_OK? datasize : 0;
}

static size_t uart1_read(void *buf, size_t bufsize)
{
	return HAL_UART_Receive(&huart1, buf, (uint16_t)bufsize, 0U)
			== HAL_OK? bufsize : 0;
}

#include "libmcu/cli.h"
struct cli_io const *cli_io_create(void)
{
	initialize_uart1(115200);

	static const struct cli_io io = {
		.read = uart1_read,
		.write = uart1_write,
	};

	return &io;
}
